Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_31 (coord N4), U388E[N4]/U24[4]/U9[3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PERIPHERAL LP_FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_SIGNAL P0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN 31U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN_MASK (1U << 31U)
/* @} */

/*! @name PIO1_0 (coord N5), U388F[N5]/U24[3]/U9[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PERIPHERAL LP_FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_SIGNAL P1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN_MASK (1U << 0U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_0 (coord B6), U388L[B6]/U28A[M6]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_CLK_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_CLK_SIGNAL USDHC_CLK           /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_CLK_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_CLK_PIN 0U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_CLK_PIN_MASK (1U << 0U)        /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO7_1 (coord C7), U388L[C7]/U28A[M5]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_CMD_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_CMD_SIGNAL USDHC_CMD           /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_CMD_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_CMD_PIN 1U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_CMD_PIN_MASK (1U << 1U)        /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO7_2 (coord F7), U388L[F7]/U28A[B3]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D4_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D4_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D4_CHANNEL 4                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D4_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D4_PIN 2U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D4_PIN_MASK (1U << 2U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_3 (coord F6), U388L[F6]/U28A[B4]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D5_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D5_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D5_CHANNEL 5                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D5_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D5_PIN 3U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D5_PIN_MASK (1U << 3U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_4 (coord E6), U388L[E6]/U28A[B5]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D6_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D6_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D6_CHANNEL 6                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D6_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D6_PIN 4U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D6_PIN_MASK (1U << 4U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_5 (coord D6), U388L[D6]/U28A[B6]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D7_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D7_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D7_CHANNEL 7                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D7_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D7_PIN 5U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D7_PIN_MASK (1U << 5U)        /*!<@brief PORT pin mask */
                                                              /* @} */

