Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO7_6 (coord B7), U388L[B7]/U28A[A3]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D0_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D0_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D0_CHANNEL 0                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D0_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D0_PIN 6U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D0_PIN_MASK (1U << 6U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_7 (coord B8), U388L[B8]/U28A[A4]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D1_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D1_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D1_CHANNEL 1                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D1_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D1_PIN 7U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D1_PIN_MASK (1U << 7U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_8 (coord C6), U388L[C6]/U28A[A5]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D2_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D2_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D2_CHANNEL 2                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D2_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D2_PIN 8U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D2_PIN_MASK (1U << 8U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_9 (coord A6), U388L[A6]/U28A[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_D3_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_D3_SIGNAL USDHC_DATA          /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_D3_CHANNEL 3                  /*!<@brief Signal channel */
#define BOARD_INITEMMCPINS_EMMC_D3_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_D3_PIN 9U                     /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_D3_PIN_MASK (1U << 9U)        /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_10 (coord E5), U388L[E5]/U28A[H5]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_DS_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_DS_SIGNAL USDHC_STROBE        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_DS_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_DS_PIN 10U                    /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_DS_PIN_MASK (1U << 10U)       /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO7_12 (coord F8), U388L[F8]/U28A[K5]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_EMMC_RST_N_PERIPHERAL USDHC0          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_EMMC_RST_N_SIGNAL USDHC_RESET_B       /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_EMMC_RST_N_PORT 7U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_EMMC_RST_N_PIN 12U                    /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_EMMC_RST_N_PIN_MASK (1U << 12U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEMMCPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM 0x3000u    /*!<@brief Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_24 (coord G12), U388L[G12]/J47[9]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_CARD_DET_N_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD1_CARD_DET_N_SIGNAL USDHC_CARD_DET     /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD1_CARD_DET_N_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SD1_CARD_DET_N_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SD1_CARD_DET_N_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO7_17 (coord L17), U388L[L17]/U59[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC1_CLK_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC1_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC1_CLK_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC1_CLK_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC1_CLK_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO7_18 (coord L16), U388L[L16]/U59[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC1_CMD_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC1_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC1_CMD_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC1_CMD_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC1_CMD_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO7_19 (coord M17), U388L[M17]/U58[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC1_DATA0_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC1_DATA0_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC1_DATA0_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC1_DATA0_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC1_DATA0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC1_DATA0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

