Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO7_20 (coord M18), U388L[M18]/U58[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC1_DATA1_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC1_DATA1_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC1_DATA1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC1_DATA1_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC1_DATA1_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC1_DATA1_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_21 (coord K18), U388L[K18]/U57[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC1_DATA2_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC1_DATA2_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC1_DATA2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC1_DATA2_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC1_DATA2_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC1_DATA2_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_22 (coord K17), U388L[K17]/U57[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC1_DATA3_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC1_DATA3_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC1_DATA3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC1_DATA3_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC1_DATA3_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC1_DATA3_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_11 (coord C5), U388L[C5]/U52[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_PWREN_B_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_PWREN_B_CHANNEL 11                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_6 (coord J5), U388E[J5]/U31[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PERIPHERAL LP_FLEXCOMM8  /*!<@brief Peripheral name */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_SIGNAL P0                /*!<@brief Signal name */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO0_7 (coord K5), U388E[K5]/U31[4]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PERIPHERAL LP_FLEXCOMM8  /*!<@brief Peripheral name */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_SIGNAL P1                /*!<@brief Signal name */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_11 (coord R2), U388F[R2]
  @{ */
/* Routed pin properties */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SDA_PERIPHERAL LP_FLEXCOMM2   /*!<@brief Peripheral name */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SDA_SIGNAL P0                 /*!<@brief Signal name */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SDA_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SDA_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO1_12 (coord R1), U388F[R1]
  @{ */
/* Routed pin properties */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SCL_PERIPHERAL LP_FLEXCOMM2   /*!<@brief Peripheral name */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SCL_SIGNAL P1                 /*!<@brief Signal name */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SCL_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITCODEC_I2CPINS_FC2_I2C2_SCL_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCODEC_I2CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u                   /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u                /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM 0x3000u               /*!<@brief Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u                /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC5 0x05u                       /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_FUNC6 0x06u                       /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_EN 0x40u                    /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u                      /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u                 /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u                 /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u                     /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u            /*!<@brief Normal mode */
#define SAI0_MCLK_CTRL_SAIMCLKDIR_SAIMCLKOEN_1 0x01u /*!<@brief SAI0-2 MCLK Direction Control: Output */

/*! @name PIO0_0 (coord J1), U388E[J1]/J21[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_DC_SAI0_RX_BCLK_PERIPHERAL SAI0          /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_DC_SAI0_RX_BCLK_SIGNAL RX_BCLK           /*!<@brief Signal name */
#define BOARD_INITI2SPINS_DC_SAI0_RX_BCLK_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_DC_SAI0_RX_BCLK_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_DC_SAI0_RX_BCLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_1 (coord J2), U388E[J2]/J21[9]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_DC_SAI0_RX_SYNC_PERIPHERAL SAI0          /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_DC_SAI0_RX_SYNC_SIGNAL RX_SYNC           /*!<@brief Signal name */
#define BOARD_INITI2SPINS_DC_SAI0_RX_SYNC_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_DC_SAI0_RX_SYNC_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_DC_SAI0_RX_SYNC_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_2 (coord J3), U388E[J3]/U29[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_RXD0_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_RXD0_SIGNAL RXD0               /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_RXD0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_RXD0_PIN 2U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_RXD0_PIN_MASK (1U << 2U)       /*!<@brief PORT pin mask */
                                                              /* @} */

