Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO0_3 (coord J4), U388E[J4]/U29[E1]/J21[23]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PERIPHERAL SAI0
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_SIGNAL TX_BCLK
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN_MASK (1U << 3U)
/* @} */

/*! @name PIO0_4 (coord K4), U388E[K4]/U29[D1]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TXD0_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TXD0_SIGNAL TXD0               /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TXD0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TXD0_PIN 4U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TXD0_PIN_MASK (1U << 4U)       /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_5 (coord K3), U388E[K3]/U29[D3]/J21[16]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PERIPHERAL SAI0
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_SIGNAL TX_SYNC
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO0_21 (coord M2), U388E[M2]/U29[G7]/J21[1]/
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_MCLK_PERIPHERAL CLKCTL0                 /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_MCLK_SIGNAL MCLK                        /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_MCLK_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_MCLK_PIN 21U                            /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_MCLK_PIN_MASK (1U << 21U)               /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_16 (coord P5), U388F[P5]/J44[36]
  @{ */
/* Routed pin properties */
#define BOARD_INITI3CPINS_I3C0_PUR_PERIPHERAL I3C0           /*!<@brief Peripheral name */
#define BOARD_INITI3CPINS_I3C0_PUR_SIGNAL PUR                /*!<@brief Signal name */
#define BOARD_INITI3CPINS_I3C0_PUR_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI3CPINS_I3C0_PUR_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITI3CPINS_I3C0_PUR_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_17 (coord R4), U388F[R4]/J44[32]
  @{ */
/* Routed pin properties */
#define BOARD_INITI3CPINS_I3C0_SCL_PERIPHERAL I3C0           /*!<@brief Peripheral name */
#define BOARD_INITI3CPINS_I3C0_SCL_SIGNAL SCL                /*!<@brief Signal name */
#define BOARD_INITI3CPINS_I3C0_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI3CPINS_I3C0_SCL_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITI3CPINS_I3C0_SCL_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_18 (coord R5), U388F[R5]/J44[22]
  @{ */
/* Routed pin properties */
#define BOARD_INITI3CPINS_I3C0_SDA_PERIPHERAL I3C0           /*!<@brief Peripheral name */
#define BOARD_INITI3CPINS_I3C0_SDA_SIGNAL SDA                /*!<@brief Signal name */
#define BOARD_INITI3CPINS_I3C0_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI3CPINS_I3C0_SDA_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITI3CPINS_I3C0_SDA_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI3CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

