Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO0_9 (coord L7), U388E[L7]/SW5[1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITBUTTONSPINS_USER_Button1_PERIPHERAL GPIO0
/*!
 * @brief Signal name */
#define BOARD_INITBUTTONSPINS_USER_Button1_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITBUTTONSPINS_USER_Button1_CHANNEL 9

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_USER_Button1_GPIO GPIO0
/*!
 * @brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_USER_Button1_GPIO_PIN_MASK (1U << 9U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_USER_Button1_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITBUTTONSPINS_USER_Button1_PIN 9U
/*!
 * @brief PORT pin mask */
#define BOARD_INITBUTTONSPINS_USER_Button1_PIN_MASK (1U << 9U)
/* @} */

/*! @name PIO1_3 (coord P6), U388F[P6]/SW7[1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITBUTTONSPINS_USER_Button2_PERIPHERAL GPIO1
/*!
 * @brief Signal name */
#define BOARD_INITBUTTONSPINS_USER_Button2_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITBUTTONSPINS_USER_Button2_CHANNEL 3

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_USER_Button2_GPIO GPIO1
/*!
 * @brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_USER_Button2_GPIO_PIN_MASK (1U << 3U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_USER_Button2_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITBUTTONSPINS_USER_Button2_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_INITBUTTONSPINS_USER_Button2_PIN_MASK (1U << 3U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_17 (coord N6), U388E[N6]/Q4[2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PERIPHERAL GPIO0
/*!
 * @brief Signal name */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_CHANNEL 17

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_GPIO GPIO0
/*!
 * @brief GPIO pin mask */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_GPIO_PIN_MASK (1U << 17U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PIN 17U
/*!
 * @brief PORT pin mask */
#define BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PIN_MASK (1U << 17U)
/* @} */

/*! @name PIO0_18 (coord M7), U388E[M7]/Q4[5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PERIPHERAL GPIO0
/*!
 * @brief Signal name */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_CHANNEL 18

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_GPIO GPIO0
/*!
 * @brief GPIO pin mask */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_GPIO_PIN_MASK (1U << 18U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PIN 18U
/*!
 * @brief PORT pin mask */
#define BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PIN_MASK (1U << 18U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO6_1 (coord D17), U388K[D17]/U38[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_SIGNAL SCLK0               /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PIN 1U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PIN_MASK (1U << 1U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_2 (coord G11), U388K[G11]/U38[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_SIGNAL SS0_N               /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PIN 2U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PIN_MASK (1U << 2U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_3 (coord F13), U388K[F13]/U38[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_CHANNEL 0                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PIN 3U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PIN_MASK (1U << 3U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_4 (coord D14), U388K[D14]/U38[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_CHANNEL 1                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PIN 4U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PIN_MASK (1U << 4U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

