Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO6_5 (coord C15), U388K[C15]/U38[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_CHANNEL 2                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PIN 5U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PIN_MASK (1U << 5U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_6 (coord E13), U388K[E13]/U38[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_CHANNEL 3                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PIN 6U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PIN_MASK (1U << 6U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_7 (coord D15), U388K[D15]/U38[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DQS0_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DQS0_SIGNAL DQS0                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DQS0_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DQS0_PIN 7U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DQS0_PIN_MASK (1U << 7U)        /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO6_8 (coord G13), U388K[G13]/U38[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA4_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA4_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA4_CHANNEL 4                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA4_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA4_PIN 8U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA4_PIN_MASK (1U << 8U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_9 (coord F15), U388K[F15]/U38[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA5_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA5_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA5_CHANNEL 5                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA5_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA5_PIN 9U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA5_PIN_MASK (1U << 9U)        /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_10 (coord E14), U388[E14]/U38[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA6_PERIPHERAL XSPI0          /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA6_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA6_CHANNEL 6                 /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA6_PORT 6U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA6_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA6_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO6_11 (coord F14), U388K[F14]/U38[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA7_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA7_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA7_CHANNEL 7                  /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA7_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA7_PIN 11U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA7_PIN_MASK (1U << 11U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO6_0 (coord D16), U388K[D16]/U38[B1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_PERIPHERAL XSPI0           /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_SIGNAL SCLK0_N             /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_PORT 6U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_PIN 0U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_PIN_MASK (1U << 0U)        /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO6_12 (coord G10), U388K[G10]/U28A[E5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_EMMC_QRDY_PERIPHERAL XSPI0            /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_EMMC_QRDY_SIGNAL SS1_N                /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_EMMC_QRDY_PORT 6U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_EMMC_QRDY_PIN 12U                     /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_EMMC_QRDY_PIN_MASK (1U << 12U)        /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI0Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

