Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC3 0x03u            /*!<@brief Selects pin function 3 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO5_0 (coord H13), U388J[H13]/U49[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_SIGNAL SS0_N              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PIN 0U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PIN_MASK (1U << 0U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_1 (coord H17), U388J[H17]/U43[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PIN 1U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PIN_MASK (1U << 1U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_2 (coord H18), U388J[H18]/U43[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PIN 2U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PIN_MASK (1U << 2U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_3 (coord F18), U388J[F18]/U44[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PIN 3U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PIN_MASK (1U << 3U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_4 (coord F16), U388J[F16]/U44[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PIN 4U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PIN_MASK (1U << 4U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_5 (coord G16), U388J[G16]/U48[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_SIGNAL DQS0               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PIN 5U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PIN_MASK (1U << 5U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO5_6 (coord E16), U388J[E16]/U50[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_CHANNEL 4                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PIN 6U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PIN_MASK (1U << 6U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_7 (coord K16), U388J[K16]/U50[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_CHANNEL 5                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PIN 7U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PIN_MASK (1U << 7U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_8 (coord H16), U388J[H16]/U42[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_CHANNEL 6                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PIN 8U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PIN_MASK (1U << 8U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_9 (coord J16), U388J[J16]/U42[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_CHANNEL 7                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PIN 9U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PIN_MASK (1U << 9U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

