Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO5_10 (coord F17), U388J[F17]/U49[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_SIGNAL SCLK0              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_11 (coord G17), U388J[G17]/U48[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_SIGNAL SS1_N              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_12 (coord K15), U388J[K15]/U46[F5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_CHANNEL 8                  /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PIN 12U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PIN_MASK (1U << 12U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_13 (coord H15), U388J[H15]/U46[F1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_CHANNEL 9                  /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PIN 13U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PIN_MASK (1U << 13U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_14 (coord M13), U388J[M13]/U46[F7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_CHANNEL 10                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PIN 14U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PIN_MASK (1U << 14U)       /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_15 (coord J14), U388J[J14]/U46[F2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_CHANNEL 11                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PIN 15U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PIN_MASK (1U << 15U)       /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_16 (coord J15), U388J[J15]/U46[F4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_16_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_16_SIGNAL DQS1                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_16_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_16_PIN 16U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_16_PIN_MASK (1U << 16U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO5_17 (coord K13), U388J[K13]/U46[G5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_CHANNEL 12                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PIN 17U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PIN_MASK (1U << 17U)       /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_18 (coord H14), U388J[H14]/U46[G1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_CHANNEL 13                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PIN 18U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PIN_MASK (1U << 18U)       /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_19 (coord L13), U388J[L13]/U46[G7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_CHANNEL 14                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PIN 19U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PIN_MASK (1U << 19U)       /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_20 (coord K14), U388J[K14]/U46[G2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PERIPHERAL XSPI1           /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_CHANNEL 15                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PORT 5U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PIN 20U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PIN_MASK (1U << 20U)       /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI1Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

