Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO4_14 (coord E12), U388I[E12]/U34[F7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PERIPHERAL XSPI2           /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_CHANNEL 10                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PORT 4U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PIN 14U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PIN_MASK (1U << 14U)       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO4_15 (coord E10), U388I[E10]/U34[F2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PERIPHERAL XSPI2           /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_CHANNEL 11                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PORT 4U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PIN 15U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PIN_MASK (1U << 15U)       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO4_16 (coord F10), U388I[F10]/U34[F4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PERIPHERAL XSPI2           /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_SIGNAL DQS1                /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PORT 4U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PIN 16U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PIN_MASK (1U << 16U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO4_17 (coord F12), U388I[F12]/U34[G5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PERIPHERAL XSPI2           /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_CHANNEL 12                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PORT 4U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PIN 17U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PIN_MASK (1U << 17U)       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO4_18 (coord E9), U388I[E9]/U34[G1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_CHANNEL 13                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO4_19 (coord D12), U388I[D12]/U34[G7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PERIPHERAL XSPI2           /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_CHANNEL 14                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PORT 4U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PIN 19U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PIN_MASK (1U << 19U)       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO4_20 (coord D10), U388I[D10]/U34[G2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PERIPHERAL XSPI2           /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_SIGNAL DATA                /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_CHANNEL 15                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PORT 4U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PIN 20U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PIN_MASK (1U << 20U)       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO4_11 (coord B11), U388I[B11]/U34[B2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_PERIPHERAL XSPI2
/*!
 * @brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_SIGNAL SCLK0_N
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_PIN 11U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_PIN_MASK (1U << 11U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI2Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SCL_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SCL_ODENA_ODENA_1 0x01u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SDA_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SDA_ODENA_ODENA_1 0x01u

/*! @name PMIC_I2C_SCL (coord U8), U388C[U8]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMIC_I2CPINS_PMIC_I2C_SCL_PERIPHERAL LPI2C15    /*!<@brief Peripheral name */
#define BOARD_INITPMIC_I2CPINS_PMIC_I2C_SCL_SIGNAL SCL            /*!<@brief Signal name */
                                                                  /* @} */

/*! @name PMIC_I2C_SDA (coord U7), U388C[U7]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMIC_I2CPINS_PMIC_I2C_SDA_PERIPHERAL LPI2C15    /*!<@brief Peripheral name */
#define BOARD_INITPMIC_I2CPINS_PMIC_I2C_SDA_SIGNAL SDA            /*!<@brief Signal name */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMIC_I2CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

