Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_14 (coord P14), U388L[P14]/U35[E4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_PERIPHERAL GPIO7
/*!
 * @brief Signal name */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_CHANNEL 14

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_GPIO GPIO7
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_GPIO_PIN_MASK (1U << 14U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_PORT 7U
/*!
 * @brief PORT pin number */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_PIN 14U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL0_PIN_MASK (1U << 14U)
/* @} */

/*! @name PIO7_15 (coord M14), U388L[M14]/U35[E3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_PERIPHERAL GPIO7
/*!
 * @brief Signal name */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_CHANNEL 15

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_GPIO GPIO7
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_GPIO_PIN_MASK (1U << 15U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_PORT 7U
/*!
 * @brief PORT pin number */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL1_PIN_MASK (1U << 15U)
/* @} */

/*! @name PIO7_16 (coord M15), U388L[M15]/U35[C5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_PERIPHERAL GPIO7
/*!
 * @brief Signal name */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_CHANNEL 16

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_GPIO GPIO7
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_GPIO_PIN_MASK (1U << 16U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_PORT 7U
/*!
 * @brief PORT pin number */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_PIN 16U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPMIC_DVSPINS_PMIC_DVS_CTRL2_PIN_MASK (1U << 16U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMIC_DVSPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */
#define IOPCTL_PIO_SLEW_RATE_SLOW 0x80u   /*!<@brief Slow mode */

/*! @name PIO2_6 (coord H6), U388G[H6]/J5[7]/J4[13]/J53[15]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D6_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D6_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D6_CHANNEL 6
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D6_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D6_PIN 6U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D6_PIN_MASK (1U << 6U)
/* @} */

/*! @name PIO2_7 (coord G6), U388G[G6]/J5[8]/J22[1]/J4[14]/J53[16]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D7_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D7_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D7_CHANNEL 7
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D7_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D7_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D7_PIN_MASK (1U << 7U)
/* @} */

/*! @name PIO2_8 (coord G4), U388G[G4]/J6[1]/J52[13]/J4[15]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D8_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D8_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D8_CHANNEL 8
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D8_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D8_PIN 8U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D8_PIN_MASK (1U << 8U)
/* @} */

/*! @name PIO2_9 (coord G5), U388G[G5]/J6[2]/J53[14]/J4[16]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D9_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D9_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D9_CHANNEL 9
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D9_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D9_PIN 9U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D9_PIN_MASK (1U << 9U)
/* @} */

