Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.h
/*! @name PIO2_10 (coord F5), U388G[F5]/J53[11]/J4[15]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D10_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D10_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D10_CHANNEL 10
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D10_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D10_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D10_PIN_MASK (1U << 10U)
/* @} */

/*! @name PIO2_11 (coord F3), U388G[F3]/J53[12]/J4[18]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D11_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D11_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D11_CHANNEL 11
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D11_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D11_PIN 11U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D11_PIN_MASK (1U << 11U)
/* @} */

/*! @name PIO2_12 (coord E3), U388G[E3]/J53[9]/J4[19]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D12_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D12_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D12_CHANNEL 12
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D12_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D12_PIN 12U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D12_PIN_MASK (1U << 12U)
/* @} */

/*! @name PIO2_13 (coord E4), U388G[E4]/J53[10]/J4[20]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D13_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D13_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D13_CHANNEL 13
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D13_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D13_PIN 13U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D13_PIN_MASK (1U << 13U)
/* @} */

/*! @name PIO2_0 (coord H2), U388G[H2]/J5[5]/J4[9]/J53[18]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PERIPHERAL GPIO2
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_CHANNEL 0

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_GPIO GPIO2
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_GPIO_PIN_MASK (1U << 0U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PIN_MASK (1U << 0U)
/* @} */

/*! @name PIO2_1 (coord G2), U388G[G2]/J5[6]/J4[8]/J53[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PERIPHERAL GPIO2
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_CHANNEL 1

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_GPIO GPIO2
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_GPIO_PIN_MASK (1U << 1U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PIN_MASK (1U << 1U)
/* @} */

/*! @name PIO2_15 (coord D3), U388G[D3]/J5[3]/J11[1]/J4[7]/J53[8]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_PERIPHERAL GPIO2
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_CHANNEL 15

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_GPIO GPIO2
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_GPIO_PIN_MASK (1U << 15U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PANELPINS_FXIO_D15_PIN_MASK (1U << 15U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_PANELPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
